{"id":"f3a7c610-2aa2-11ec-96a4-e9db62f5d62e","updated_at":"2021-10-12T07:21:07.129Z","updated_by":"83260762","created_at":"2021-10-11T14:53:11.244Z","created_by":"83260762","name":"1.1.1 Ensure that the API server pod specification file permissions are set to 644 or more restrictive","tags":["CIS"],"interval":"5m","enabled":true,"description":"Ensure that the API server pod specification file has permissions of 644 or more restrictive.","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://ido-cis.kb.eastus2.staging.azure.foundit.no:9243/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"a35206f8-76ec-44d1-bd63-fc95cdd2bcea","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["osquery-index*"],"query":"any where osquery.filename == \"kube-apiserver.yaml\" and not osquery.mode regex (\"0+(0|1|2|3|4|5|6)+(0|1|2|3|4)+(0|1|2|3|4)\")","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
